app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "JK"], ["last_name", "Rowling"], ["created_at", "2016-03-20 20:27:04.454859"], ["updated_at", "2016-03-20 20:27:04.454859"]]
---
  def create
    @author = Author.new(author_params)
    if @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "authors" SET "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["last_name", "faceless"], ["updated_at", "2016-03-20 20:34:51.051204"], ["id", 5]]
---
  def update
    @author = Author.find(params[:id])
    if @author.update(author_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 5]]
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy