app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)
    if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Obama"], ["created_at", "2016-03-20 23:16:03.438998"], ["updated_at", "2016-03-20 23:16:03.438998"]]

  def update
    @tag = Tag.find(params[:id])
    if @tag.update(tag_params)
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "aSDSD"], ["updated_at", "2016-03-20 23:20:22.446396"], ["id", 10]]